
var q = [
"529年頃イタリアのモンテ＝カシノ修道院を創設し、修道院運動をう推奨したのは誰か？",
"12〜13世紀イギリス王やフランス王を屈服させ、教皇権の絶頂期を現出したのは誰か？",
"北アフリカを支配し、534年ユスティニアヌスに滅ぼされたゲルマン人国家をなんというか？",
"偶像崇拝を禁止するイスターム教徒に対し、726年聖像禁止令を発布したビザンツ皇帝は誰か？",
"10世紀末頃アジア系のマジャーツ人が、ドナウ川中流域のパンノニア平原を中心に建てた国をなんというか？",
"リトアニアをポーランドが合併して成立したポーランド最盛期の王朝をなんというか？",
"10世紀末のキエフ王国最盛期の大公で、ギリシア正教に改宗し、ビザンツ皇帝の妹と結婚するなど、ロシアのビザンツ化を進めたのは誰か？",
"14世紀以降、キプチャク＝ハン濃くおから自立化を進めた国はどこか？",
"モスクワ大公国の大公のうち、キプチャク＝ハン国から完全に自立を達成したのは誰か？",
"イヴァン3世が使用した皇帝を意味する称号をなんというか？",
"聖地奪回を目指し、1095年十字軍を提唱したローマ教皇は誰か？",
"十字軍派遣が決定された会議を年というか？",
"第1回十字軍で聖地回復に成功した後、1099年占領地に建てられた封建国家をなんというか？",
"アイユーブ朝の建国者で、十字軍から聖地を奪回し、第3回十字軍と戦ったのは誰か？",
"第4回十字軍が、コンスタンティノープルを占領して建てた国をなんというか？",
"北イタリアのトスカナ地方にあり、毛織物工業と金融業が発達した都市はどこか？",
"フィレンツェの大商人で、一族から教皇や王族を輩出した家は何か？",
"ブリュージュを中心とした毛織物工業が発達した、ネーデルランド南西部の地方を何というか？",
"南ドイツのアウスクブルクを中心に栄えた金融業者を何というか？",
"1381年、農奴制の廃止などを要求して起こったイギリスの農民一揆を何というか？",
"ヘンリ3世がマグナカルタを無視し、専制を強化したことに対し、貴族を率いて反乱を起こしたのは誰か？",
"1295年にエドワード1世が招集した身分制議会を何というか？",
"1328年、カペー朝の断絶後フランスに成立した王朝を何というか？",
"1485年、バラ戦争をおさめたランカスター一派のヘンリ7世が即位して開いた王朝を何というか？",
"東方植民によって12世紀に成立し、15世紀にはホーエンツォレルン家領となった諸侯国を何というか？",
"1356年に金印勅書を発布した皇帝は誰か？",
"15世紀半ば以降、神聖ローマ皇帝位を世襲したオーストリアの王家を何というか？",
"ハプスブルク家の支配に対して13世紀末に独立闘争を開始し、15世紀末には事実上独立を達成した地域はどこか？",
"イベリア半島における最後のイスラーム王朝を何というか？",
"1492年に陥落した、ナスル朝の都はどこか？",
"12世紀にカスティ槍から独立し、15世紀には積極的に海外に進出するようになった王国はどこか？",
"14世紀末にデンマーク、スウェーデン、ノルウェーなど、北米の３国が同君連合をすることになった同盟を何というか？",
"カルマル同盟を主導した、デンマーク女王は誰か？",
"イギリスの神学者で、けーる大帝に招かれカロリング＝ルネサンスの運動の中心となった人物は誰か？",
"13世紀イギリスの科学者・哲学者で実験や観察を重視し、近代自然科学に大きな影響を与えた人物は誰か？",
"騎士道文学のうち、カール大帝のイスラーム討伐遠征を題材とし、騎士の武勇をふたった物語を何というか？",
"騎士道文学のうち、ケルト人の伝説的英雄を題材にした物語を何というか？",
"ゲルマン人の英雄を題材とした叙事詩を何というか？",
"各地の宮廷を巡り歩き、騎士的恋愛を歌った詩人を何というか？",
"11〜12世紀に成立し、重厚な壁と小さな窓、半円状のアーチを特徴とする建築様式を何というか？",
"12〜13世紀に普及した、高い天井や尖頭アーチを特徴とする建築様式を何というか？",
"ゴシック様式の建築物の窓に多く用いられた彩色ガラスを何というか？"
]

var a = [
"ベネティクトゥス",
"インノケンティウス３世",
"ヴァンダル王国",
"レオン3世",
"ハンガリー",
"ヤゲウォ朝",
"ウラディミル1世",
"モスクワ大公国",
"イヴァン3世",
"ツァーリ",
"ウルバヌス2世",
"クレルモン宗教界",
"イェルサレム王国",
"サラディン",
"ラテン帝国",
"フィレンツェ",
"メディチ家",
"フランドル地方",
"フッガー家",
"クットニタイラーの乱",
"シモン＝ド＝モンフォール",
"模範議会",
"ヴァロア朝",
"テューダ朝",
"ブランデンブルク辺境伯領",
"カール4世",
"ハプスブルク家",
"スイス",
"ナスル朝",
"グラナダ",
"ポルトガル",
"カルマル同盟",
"マルグレーテ",
"アルクイン",
"ロジャー＝ベーコン",
"ローランの歌",
"アーサー王物語",
"ニーベルニゲンの歌",
"吟遊詩人",
"ロマネスク様式",
"ゴシック様式",
"ステンドグラス"
]

var num = Math.floor(Math.random()*(43-1));
function question(){
  document.getElementById("que").innerHTML = "問題：" + q[num]
}
function answer(){
  document.getElementById("ans").innerHTML = "答え：" + a[num]
}
function reset(){
  num = Math.floor(Math.random()*(43-1));
  document.getElementById("que").innerHTML = "問題：" + q[num]
  document.getElementById("ans").innerHTML = "答え："
}
